gmacs.org
#+TITLE: My Emacs Configuration
#+PROPERTY: header-args :results silent :tangle gmacs.el
* Starting Up
** Fixing the UI
:PROPERTIES:
:header-args: :tangle no
:END:
Emacs ships with a set of pretty strange defaults. The UI is the first thing we
see when we open Emacs, so it better not look ugly. We're going to configure
part of the UI outside Emacs entirely, by editing the =~/.Xresources=.

This kills the ugly parts of the UI before they are born. This is slightly
faster than disabling them within Emacs, but it offers less flexibility. For
example, if Emacs fails to start up properly, you are possibly left staring at a
chimera of an editor, with default font colours but themed background
colours. Because the font is about the same shade as the background, this makes
for some very fun times debugging.

After editing =.Xresources=, remember to reload it with =xrdb merge ~/.Xresources=.
*** Bars
I never use menu bars, tool bars, or scroll bars in Emacs.
#+BEGIN_SRC conf
Emacs.menuBar: off
Emacs.toolBar: off
Emacs.verticalScrollBars: off
#+END_SRC
*** Cursor Blinking
In earlier versions of Emacs, the cursor would blink ten or so times, then
suddenly stop. This got annoying quickly.
#+BEGIN_SRC conf
Emacs.cursorBlink: off
#+END_SRC
*** Background Colour
Before a theme is initialized, the default background colour that Emacs displays
is white. However, my default theme is a dark theme (Solarized Dark). If I were
to change the background colour after Emacs starts, the screen would flash as it
changes colour. And so I set the default background and foreground colour to be
that of Solarized Dark.
#+BEGIN_SRC conf
Emacs.background: #002b36
Emacs.foreground: #839496
#+END_SRC
The last thing left that is visible throughout startup is the modeline. It
took a bit of Internet sleuthing to figure out how to set this, but here it is.
#+BEGIN_SRC conf
Emacs.mode-line.attributeForeground: #93a1a1
Emacs.mode-line.attributeBackground: #002b36
Emacs.mode-line.attributeBox: (:line-width 1 :color "#073642")
#+END_SRC
*** Default Font
I often experiment with fonts during an Emacs session, so I set up an easy way
to change that [[*Font Face][here]]. On startup, though, I want something neutral, so I go with
Hack.
#+BEGIN_SRC conf
Emacs.font: Hack-10
#+END_SRC
** Early Init
Here's some cutting edge technology. Emacs 27 introduced =early-init.el=, which
is run before =init.el=, before package initialization.

Package initialization occurs automatically, before =user-init-file= is loaded,
but after =early-init-file=. As we'll see later, we can handle package
initialization ourselves, so there's no need for Emacs to do it first.
#+BEGIN_SRC emacs-lisp :tangle early-init.el
(setq package-enable-at-startup nil)
#+END_SRC
** =init.el=
The main entry point into GMACS. First, we remove some features that would make
startup take longer and aren't that useful.
#+BEGIN_SRC emacs-lisp :tangle init.el
(advice-add #'display-startup-echo-area-message :override #'ignore)
(setq inhibit-startup-message t
      inhibit-startup-echo-area-message user-login-name
      inhibit-default-init t
      initial-major-mode 'fundamental-mode
      initial-scratch-message nil)
#+END_SRC
We either load the byte-compiled GMACS configuration file or tangle and load
the GMACS literate config file (you're reading it!) written in Org Mode.
#+BEGIN_SRC emacs-lisp :tangle init.el
(let ((file-name-handler-alist nil)
      (orgfile (expand-file-name "gmacs.org" user-emacs-directory))
      (elfile (expand-file-name "gmacs.el" user-emacs-directory))
      (elcfile (expand-file-name "gmacs.elc" user-emacs-directory))
      (personalfile (expand-file-name "personal.el" user-emacs-directory)))
  (if (file-exists-p elcfile)
      (load-file elcfile)
    (if (or (not (file-exists-p elfile))
            (file-newer-than-file-p orgfile elfile))
        (progn
          (require 'org)
          (org-babel-load-file orgfile))
      (load-file elfile)))
  (when (file-exists-p personalfile)
    (load-file personalfile)))
#+END_SRC
** Initialization Settings
Enable lexical binding.
#+BEGIN_SRC emacs-lisp
;; -*- lexical-binding: t -*-
#+END_SRC
Always load up a server when opening Emacs.
#+BEGIN_SRC emacs-lisp
(server-start)
#+END_SRC
I was inspired to implement the following optimizations in GMACS thanks to
[[https://github.com/nilcons/emacs-use-package-fast][nilcons/emacs-use-package-fast]]. During startup, we make the garbage collection
threshold very high. [[*Garbage Collection][After startup]], we manage garbage collection with a package.
#+BEGIN_SRC emacs-lisp
(setq gc-cons-threshold #x40000000)
#+END_SRC
We increase these so that we don't exceed recursion limits unless there is some
kind of infinite loop.
#+BEGIN_SRC emacs-lisp
(setq max-lisp-eval-depth 50000
      max-specpdl-size 10000)
#+END_SRC
Now we prevent loading double buffers, which reduces stuttering.
#+BEGIN_SRC emacs-lisp
(add-to-list 'default-frame-alist '(inhibit-double-buffering . t))
#+END_SRC
Silence some common warnings from the byte-compiler.
#+BEGIN_SRC emacs-lisp
(setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
#+END_SRC
Let the user know how quickly GMACS started.
#+BEGIN_SRC emacs-lisp
(defun gm/startup-time ()
  (interactive)
  (message "GMACS ready in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                    (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'after-init-hook #'gm/startup-time)
#+END_SRC
** Directories and File Locations
We define a few custom directories to satisfy my own wishes for how things
should be named and to speed up the package initialization process by doing it
ourselves, rather than relying on =package-initialize=. Note that the whole thing
is wrapped in a byte-compile block.

We make the directories if they don't exist by iterating over a list. This
method makes it easy for to extend to more directories if needed.
#+BEGIN_SRC emacs-lisp
(eval-and-compile
  (defvar gmacs-packages-dir (concat user-emacs-directory "packages/")
    "Where package.el and elpa plugins (and their caches) are stored.")

  (defvar gmacs-custom-dir (concat user-emacs-directory "elisp/")
    "Where custom lisp files are stored")

  (defvar gmacs-cache-dir (concat user-emacs-directory "cache/")
    "Where temporary files that could be deleted without anything
    terrible happening are stored.")

  (dolist (dir (list gmacs-packages-dir
                     gmacs-custom-dir
                     gmacs-cache-dir))
    (unless (file-directory-p dir)
      (make-directory dir t))))
#+END_SRC
#+BEGIN_SRC emacs-lisp
(defvar gm/user nil)
#+END_SRC
I put custom variables outside of my =init.el= file.
#+BEGIN_SRC emacs-lisp
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file) (load custom-file))
#+END_SRC
Make a variable for personal settings.
** Setup Packages
We're going to use a custom package directory, so we need to trick Emacs into
thinking it has initialized packages by setting =package--init-file-ensured= to =t=.
Also, we don't enable packages at startup, because we will let =use-package=
intelligently defer and handle package loading.
#+BEGIN_SRC emacs-lisp
(eval-and-compile
  (setq load-prefer-newer t
        package-user-dir gmacs-packages-dir
        package--init-file-ensured t
        package-enable-at-startup nil))
#+END_SRC
We set the =load-path= ourselves. This will be faster than letting
=package-intialize= handle it, because we only add directories we know are from
packages. This way, we don't need to search all third party paths every time we
require a file. We'll also store custom or third-party Emacs Lisp files in
=gmacs-custom-dir=, so we add that to the =load-path=.
#+BEGIN_SRC emacs-lisp
(eval-and-compile
  (setq load-path (append load-path (directory-files package-user-dir t "^[^.]" t)))
  (add-to-list 'load-path gmacs-custom-dir))
#+END_SRC
Our next step is to load =package.el=. We add our package repositories "melpa" and
"gnu," because Emacs' default list of packages is so conservative. Then we need
to initialize the packages and make sure that =use-package= is installed if its
missing. Finally, we tell =use-package= to always install missing packages.
Otherwise, an error would be thrown when a package is missing.

We use the following package archives.
#+BEGIN_SRC emacs-lisp :tangle no :noweb-ref pack-arch
(setq package-archives
        '(("melpa" . "https://melpa.org/packages/")
          ("gnu" . "https://elpa.gnu.org/packages/")
          ("org" . "http://orgmode.org/elpa/")))
#+END_SRC
Note that this whole process is only run when the file is byte-compiled. This
means that by the time the code is actually evaluated, the =use-package= macro has
been expanded, so the package is not needed anymore. As such, we can do all the
expensive and time-consuming work of getting the packages ready before Emacs has
even started, during byte-compilation. If this config has not been manually
byte-compiled, Emacs will initialize packages on startup as usual.
#+BEGIN_SRC emacs-lisp :noweb no-export
(eval-when-compile
  (require 'package)
  <<pack-arch>>
  (package-initialize)
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (require 'use-package))
#+END_SRC
Get =use-package= to always defer loading packages until they are actually needed.
This reduces startup time significantly. We're doing this now, before
=use-package= is even loaded, because otherwise it won't help us when the code
that loads =use-package= is evaluated upon byte-compilation.
#+BEGIN_SRc emacs-lisp
(setq use-package-always-defer t
      use-package-verbose t
      use-package-always-ensure t)
#+END_SRC
We also require =diminish= and =bind= because I often use these keywords within
=use-package= declarations.
#+BEGIN_SRC emacs-lisp
(use-package bind-key)
(use-package diminish)
#+END_SRC
*** Common Libraries
We load some packages that I use throughout my configuration.
#+BEGIN_SRC emacs-lisp
(use-package async :commands (async-start))
(use-package s :demand t)
(use-package dash :demand t :config (dash-enable-font-lock))
(eval-when-compile (require 'cl-lib))
#+END_SRC
* General Configuration
** Macros
Elisp macros. =after!= and =lambda!= are from the popular DOOM! Emacs
configuration. The documentation on these will be sparse, because the docstrings
do an excellent job of explaining what's going on.
*** after!
#+BEGIN_SRC emacs-lisp
(defmacro after! (feature &rest forms)
  "A smart wrapper around `with-eval-after-load'. Supresses warnings during
compilation."
  (declare (indent defun) (debug t))
  `(,(if (or (not (bound-and-true-p byte-compile-current-file))
             (if (symbolp feature)
                 (require feature nil :no-error)
               (load feature :no-message :no-error)))
         #'progn
       #'with-no-warnings)
    (with-eval-after-load ',feature ,@forms)))
#+END_SRC
*** lambda!
#+BEGIN_SRC emacs-lisp
(defmacro lambda! (&rest body)
  "A shortcut for inline interactive lambdas."
  (declare (doc-string 1))
  `(lambda () (interactive) ,@body))
#+END_SRC
*** Conditional Keybindings
Obtained from [[http://endlessparentheses.com/define-context-aware-keys-in-emacs.html][Endless Parentheses]].
#+BEGIN_SRC emacs-lisp
(defmacro define-conditional-key (keymap key def &rest body)
  "In KEYMAP, define key sequence KEY as DEF conditionally.
This is like `define-key', except the definition
\"disappears\" whenever BODY evaluates to nil."
  (declare (indent 3)
           (debug (form form form &rest sexp)))
  `(define-key ,keymap ,key
     '(menu-item
       ,(format "maybe-%s" (or (car (cdr-safe def)) def))
       nil
       :filter (lambda (&optional _)
                 (when ,(macroexp-progn body)
                   ,def)))))
#+END_SRC

** User Interface
Show off the title.
#+BEGIN_SRC emacs-lisp
(setq frame-title-format "GMACS")
#+END_SRC
*** Cursor
I prefer a box cursor to a bar cursor. Setting =x-stretch-cursor= means that this
bar will stretch to the full width of the character it is on. For example, on a
tab (evil tabs!), the cursor will look as wide as a tab.
#+BEGIN_SRC emacs-lisp
(when (display-graphic-p)
  (setq-default cursor-type 'box))
(setq x-stretch-cursor t)
#+END_SRC
**** Beacon Mode
Never lose your cursor again. This package lights up your cursor when the
screen/cursor position is refactored. It's much more useful than it sounds.
#+BEGIN_SRC emacs-lisp
(use-package beacon
  :defer 2
  :config (beacon-mode 1)
  :custom (beacon-color "#b58900"))
#+END_SRC
*** Bells
Visual, not audible bells.
#+BEGIN_SRC emacs-lisp
(setq ring-bell-function 'ignore)
(setq visible-bell t)
#+END_SRC
*** Modeline
The =smart-mode-line= package comes with some useful items on the modeline, as
well as colour coding. Some interesting features (which I set in
=sml/replacer-regexp-list=) is shortening features. Another useful thing is that
minor modes are displayed.
#+BEGIN_SRC emacs-lisp
(use-package smart-mode-line
  :defer 1
  :config (sml/setup))
#+END_SRC
What time is it, Mr. Emacs?
#+BEGIN_SRC emacs-lisp
(display-time-mode 1)
(setq display-time-format "%l:%M%p")
#+END_SRC
=line-number-mode= mode displays the current line number in the modeline. Except
when there is a line Emacs decides is too long. In that case, all you see in the
modeline is =??=. See [[https://emacs.stackexchange.com/questions/3824/what-piece-of-code-in-emacs-makes-line-number-mode-print-as-line-number-i][this question]] on Emacs SE for a workaround.
#+BEGIN_SRC emacs-lisp
(setq line-number-display-limit-width 10000)
#+END_SRC
Given that we're showing the line number in the modeline, it's often nice to
also have the column number.
#+BEGIN_SRC emacs-lisp
(column-number-mode 1)
#+END_SRC
*** Scrolling
There are two types of scrolling in Emacs: keyboard scrolling and mouse
scrolling. Both of them are quite jarring out of the box and make the screen
lurch around. Let's fix keyboard scrolling.
#+BEGIN_SRC emacs-lisp
(setq scroll-margin 1
      scroll-step 1
      scroll-conservatively 10000
      scroll-preserve-screen-position 1)
#+END_SRC
And make mouse scrolling smoother.
#+BEGIN_SRC emacs-lisp
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
(setq mouse-wheel-progressive-speed t) ;; don't accelerate scrolling
(setq mouse-wheel-follow-mouse t) ;; scroll window under mouse
(setq scroll-step 1) ;; keyboard scroll one line at a time
(setq scroll-margin 3) ;; give the cursor some buffer room before scrolling window
#+END_SRC
